{
  "header": {
    "home": "Главная",
    "about": "Обо мне",
    "resume": "Резюме",
    "skills": "Навыки",
    "contacts": "Контакты"
  },
  "home": {
    "name": "Роман Токмин",
    "info": "Web-разработчик, Новосибирск",
    "download": "Скачать резюме"
  },
  "about": {
    "title": "Обо мне",
    "name": "Имя: Токмин Роман",
    "birthday": "Дата рождения: 22.01.1999",
    "info": "Я начинающий веб-разработчик, в настоящее время работаю в Eltex, где разрабатываю интерфейс для сетевого оборудования, а также помогаю ему общаться с системой оборудования. Начал изучать программирование еще в НГТУ, выполняя различные лабораторные на C/C++ и реализовывая свой менеджер задач в качестве диплома на HTML/JS. Также в свободное время пишу свои проекты, сейчас изучаю React и Node JS, очень интересны эти технологии. Люблю писать документацию для проектов, а также пиццу и видеоигры!"
  },
  "resume": {
    "title": "Резюме",
    "education": {
      "title": "Новосибирский Государственный Технический Университет",
      "logoTitle": "Образование",
      "rows": [
        "Бакалавриат, 2017-2021",
        "Факультет: Автоматики и вычислительной техники",
        "Направление: Управление в технических системах",
        "Профиль: Автоматика и управление"
      ],
      "info": "Во время обучения работал с различными платами Плис\\Arduino, также изучал основы системы linux, что мне понравилось больше всего и работал в качестве лабораторных работ с различным сетевым оборудованием. Также параллельно изучал JavaScript, который пригодился для реализации моего приложения для бакалаврской работы. Сейчас продолжаю обучение на магистратуре этого направления."
    },
    "work": {
      "title": "ООО «Предприятие «Элтекс» (ELTEX) —",
      "logoTitle": "Опыт работы",
      "rows": [
        "один из ведущих российских разработчиков и производителей сетевого оборудования.",
        "Февраль 2021 - Текущее время"
      ],
      "info": "Мое первое место работы в качестве web-разработчика, где фронтенд оборудования написан на KnockautJS, запросы к системе выполнял Lua и небольшая прослойка Си-шного кода для выполнения системных вызовов. Здесь я правил баги, дописывал функционал, а также переносил проекты с KnockautJS на Angular. Писал много документации, чем упростил работу другим разработчикам, приводил в порядок старые проекты и поднимал новые. Очень много нового узнал от своих коллег, чем очень благодарен им!"
    }
  },
  "skills": {
    "title": "Навыки"
  },
  "contacts": {
    "title": "Контакты"
  },
  "lang": "rus"
}
